import { useState } from 'react';
import Screen from '../ui/Screen';

const riddles = [
    {
        q: 'Где мы познакомились?',
        a: ['В кафе', 'Онлайн', 'На улице'],
        c: 1,
    },
    {
        q: 'Это легко, дальше сложнее.',
        as: 'Какой первый фильм мы посмотрели в Пензе?',
        a: ['Гарри Поттер', 'Дорама', 'Шрек', 'Марвел', 'Я не помню'],
        c: 4,
    },
    {
        q: 'Ну я забыл что смотрели, но вопрос мне понравился.',
        as: 'Что я люблю и ценю в тебе больше всего?',
        a: ['Улыбку', 'Характер', 'Надежность и поддержка', 'Уют', 'Забота', 'Внимание', 'Атмосфера', 'Ничего', 'Всё (кроме ничего)'],
        c: 8,
    },
    {
        q: 'А чо, ну я. ',
        as: 'Сколько раз ты выходила на улицу? (в магазин не считается)',
        a: ['0', '1', '4', '3', '5', '6', 'Я уже и со счета сбилась'],
        c: 5,
    },
    {
        q: 'Я столько насчитал: "Концерт, ездили на новый год, знакомство с братом, знакомство с родителями (аэропорт), промывать зубы, просто так прогулялись по округе',
        as: 'Как зовут мою маму?',
        a: ['Гости приедут', 'Ольга Николаевна', 'Татьяна Николаевна', 'Татьяна Викторовна', 'Ольга Викторовна', 'Ольга Михайловна'],
        c: 4,
    },
    {
        q: '🙈🙈🙈🙈🙈',
        as: 'Это какой по счету вопрос?',
        a: ['5', '6', '7', 'Да, треш'],
        c: 1,
    },
];
const errorMessages = [
    'Неееее',
    'Неее 🙈',
    'Да, треш',
    'Дурак?',
    '......',
    'Окак',
    'Я бы засчитал тебе, но нет',
];


export default function RiddlesChain({ onNext }) {
    const [i, setI] = useState(0);
    const [errorText, setErrorText] = useState('');

    const answer = idx => {
        if (idx === riddles[i].c) {
            setErrorText('');
            if (i === riddles.length - 1) {
                onNext();
            } else {
                setI(prev => prev + 1);
            }
        } else {
            const random =
                errorMessages[Math.floor(Math.random() * errorMessages.length)];
            setErrorText(random);
        }
    };

    return (
        <Screen>
            <h2
                style={
                    i === riddles.length - 1
                        ? { letterSpacing: '4px', animation: 'pulse 1s infinite' }
                        : {}
                }
            >
                Викторина:{' '}
                {i === riddles.length - 1
                    ? '???'
                    : `${i + 1} из 10000`}
            </h2>
            <p>{riddles[i].q}</p>
            <p>{riddles[i].as}</p>

            {riddles[i].a.map((t, idx) => (
                <button key={idx} className="btn" onClick={() => answer(idx)}>
                    {t}
                </button>
            ))}

            {errorText && (
                <p
                    style={{
                        marginTop: 20,
                        fontSize: '1.1em',
                        color: '#ff4081',
                        animation: 'shake 0.3s',
                    }}
                >
                    {errorText}
                </p>
            )}
        </Screen>
    );
}